变量主要用来保存数据，是用标识符表示的数据类型·，是程序中可以改变的值；
变量在程序中有十分重要的作用，如：存储数据，传递数据，简练代码，提高模块化和增加可移植性

变量的声明
{
        1：java是强类型语言，变量必须先声明后使用，
         声明方式：变量类型 变量名

        2：变量的声明包括两项类容：变量类型和变量名
        变量声明的位置决定了该变量的作用域，java中通过变量名引用变量包含的数据；


       java中通过变量名来操作变量的值；变量名要保证3个基本要求：
       1；变量名必须是一个合法的标识符
       2：变量名不能是java关键字，
       3；在同一作用域，变量名是唯一的

       定义变量名的约定：
       1：变量名小写
       2：如果有多个单词，那么 第二个单词开始，首字母大写


       final变量：
       表示最终的不可变的量，在数据类型前加上final就声明类final变量

}


